mobizt/Firebase-ESP8266/src/FirebaseESP8266.h
/**
 * Google's Firebase Realtime Database Arduino Library for ESP8266, version 3.0.7
 * 
 * January 7, 2021
 * 
 *   Updates:
 * - Remove BearSSL' s Arduino ported sources that may cause conflicts with the compiled BearSSL version library.
 * 
 * 
 * This library provides ESP8266 to perform REST API by GET PUT, POST, PATCH, DELETE data from/to with Google's Firebase database using get, set, update
 * and delete calls. 
 * 
 * The library was tested and work well with ESP8266 based module and add support for multiple stream event paths.
 * 
 * The MIT License (MIT)
 * Copyright (c) 2021 K. Suwatchai (Mobizt)
 * 
 * 
 * Permission is hereby granted, free of charge, to any person returning a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 * 
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
*/

#ifndef FirebaseESP8266_H
#define FirebaseESP8266_H

#ifdef ESP8266

#include <Arduino.h>
#include <SPI.h>
#include <time.h>
#include <SD.h>
#include <vector>
#include <functional>
#include <Schedule.h>
#include <ets_sys.h>
#include <ESP8266WiFi.h>
#include "FirebaseESP8266HTTPClient.h"

#define FS_NO_GLOBALS
#include <FS.h>
#include "FirebaseJson.h"

#define FIREBASE_PORT 443
#define KEEP_ALIVE_TIMEOUT 45000
#define STREAM_ERROR_NOTIFIED_INTERVAL 3000
#define STREAM_RECONNECT_INTERVAL 1000
#define SD_CS_PIN 15
#define MAX_REDIRECT 5
#define WIFI_RECONNECT_TIMEOUT 10000
#define STREAM_TASK_STACK_SIZE 8192
#define QUEUE_TASK_STACK_SIZE 8192
#define MAX_BLOB_PAYLOAD_SIZE 1024
#define MAX_EXCHANGE_TOKEN_ATTEMPTS 5

enum fb_esp_fcm_msg_type
{
  msg_single,
  msg_multicast,
  msg_topic
};

enum fb_esp_data_type
{
  d_any,
  d_null,
  d_integer,
  d_float,
  d_double,
  d_boolean,
  d_string,
  d_json,
  d_array,
  d_blob,
  d_file,
  d_timestamp,
  d_shallow,
};

enum fb_esp_method
{
  m_put,
  m_put_nocontent,
  m_post,
  m_get,
  m_get_nocontent,
  m_stream,
  m_patch,
  m_patch_nocontent,
  m_delete,
  m_download,
  m_restore,
  m_read_rules,
  m_set_rules,
  m_get_shallow,
  m_get_priority,
  m_set_priority,
};

enum fb_esp_settings_provider_type
{
  auth_provider_type_login,
  auth_provider_type_service_account
};

enum fb_esp_auth_token_status
{
  token_status_uninitialized,
  token_status_on_signing,
  token_status_on_request,
  token_status_on_refresh,
  token_status_ready,
  token_status_error
};

enum fb_esp_auth_token_type
{
  token_type_undefined,
  token_type_legacy_token,
  token_type_id_token,
  token_type_custom_token,
  token_type_oauth2_access_token
};

enum fb_esp_jwt_generation_step
{
  fb_esp_jwt_generation_step_begin,
  fb_esp_jwt_generation_step_encode_header_payload,
  fb_esp_jwt_generation_step_sign,
  fb_esp_jwt_generation_step_exchange
};

enum fb_esp_user_email_sending_type
{
  fb_esp_user_email_sending_type_verify,
  fb_esp_user_email_sending_type_reset_psw
};

struct server_response_data_t
{
  int httpCode = -1;
  int payloadLen = -1;
  int contentLen = -1;
  fb_esp_data_type dataType = fb_esp_data_type::d_any;
  int payloadOfs = 0;
  bool boolData = false;
  int intData = 0;
  float floatData = 0.0f;
  double doubleData = 0.0f;
  std::vector<uint8_t> blobData;
  bool isEvent = false;
  bool noEvent = false;
  bool isChunkedEnc = false;
  bool hasEventData = false;
  bool noContent = false;
  bool eventPathChanged = false;
  bool dataChanged = false;
  std::string location = "";
  std::string contentType = "";
  std::string connection = "";
  std::string eventPath = "";
  std::string eventType = "";
  std::string eventData = "";
  std::string etag = "";
  std::string pushName = "";
  std::string fbError = "";
  std::string transferEnc = "";
};

struct StorageType
{
  static const uint8_t FLASH = 0;
  static const uint8_t SD = 1;
};

struct fb_esp_auth_token_error_t
{
  std::string message;
  int code = 0;
};

struct fb_esp_auth_token_info_t
{
  std::string id_token;
  std::string refresh_token;
  std::string access_token;
  std::string legacy_token;
  std::string auth_type;
  std::string jwt;
  unsigned long expires = 0;
  fb_esp_auth_token_type token_type = token_type_undefined;
  fb_esp_auth_token_status status = token_status_uninitialized;
  struct fb_esp_auth_token_error_t error;
};

struct fb_esp_auth_signin_token_t
{
  std::string uid;
  FirebaseJson claims;
};

struct fb_esp_service_account_data_info_t
{
  std::string client_email;
  std::string client_id;
  std::string project_id;
  std::string private_key_id;
  const char *private_key = "";
};

struct fb_esp_auth_signin_user_t
{
  std::string email;
  std::string password;
};

struct fb_esp_auth_cert_t
{
  const char *data = "";
  std::string file;
  uint8_t file_storage = StorageType::FLASH;
};

struct fb_esp_service_account_file_info_t
{
  std::string path;
  uint8_t storage_type = StorageType::FLASH;
};

struct fb_esp_service_account_t
{
  struct fb_esp_service_account_data_info_t data;
  struct fb_esp_service_account_file_info_t json;
};

struct fb_esp_auth_signin_provider_t
{
  struct fb_esp_auth_signin_user_t user;
  struct fb_esp_auth_signin_token_t token;
};

struct fb_esp_token_signer_resources_t
{
  int step = 0;
  int attempts = 0;
  bool signup = false;
  unsigned long lastReqMillis = 0;
  unsigned long reqTO = 2000;
  std::string pk;
  size_t hashSize = 32; //SHA256 size (256 bits or 32 bytes)
  size_t signatureSize = 256;
  char *hash = nullptr;
  unsigned char *signature = nullptr;
  std::string header;
  std::string payload;
  std::string encHeader;
  std::string encPayload;
  std::string encHeadPayload;
  std::string encSignature;
  WiFiClientSecure *wcs = nullptr;
  FirebaseJson *json = nullptr;
  FirebaseJsonData *data = nullptr;
  struct fb_esp_auth_token_info_t tokens;
  struct fb_esp_auth_token_error_t verificationError;
  struct fb_esp_auth_token_error_t resetPswError;
  struct fb_esp_auth_token_error_t signupError;
};

